Ganghyeok-Lim/Proj-STM32H743VIT6-Test-Dev-Board/02_FW/STM32H743VIT6_Dev_Bd/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <memory.h>
#include <string.h>
#include <math.h>
#include <stdint.h>
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void Delay_us(uint16_t time_us);

// About LCD
void Initialize_LCD(void);
void LCD_Command(uint8_t command);
void LCD_Data(uint8_t data);
void LCD_String(uint8_t command, uint8_t* string);

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCU_TACT_SW1_Pin GPIO_PIN_0
#define MCU_TACT_SW1_GPIO_Port GPIOC
#define MCU_TACT_SW1_EXTI_IRQn EXTI0_IRQn
#define MCU_TACT_SW2_Pin GPIO_PIN_1
#define MCU_TACT_SW2_GPIO_Port GPIOC
#define MCU_TACT_SW2_EXTI_IRQn EXTI1_IRQn
#define MCU_LED1_BLUE_Pin GPIO_PIN_0
#define MCU_LED1_BLUE_GPIO_Port GPIOB
#define MCU_LED1_GREEN_Pin GPIO_PIN_2
#define MCU_LED1_GREEN_GPIO_Port GPIOB
#define MCU_LED2_RED_Pin GPIO_PIN_12
#define MCU_LED2_RED_GPIO_Port GPIOB
#define MCU_CHAR_LCD_RS_Pin GPIO_PIN_8
#define MCU_CHAR_LCD_RS_GPIO_Port GPIOD
#define MCU_CHAR_LCD_RW_Pin GPIO_PIN_9
#define MCU_CHAR_LCD_RW_GPIO_Port GPIOD
#define MCU_CHAR_LCD_E_Pin GPIO_PIN_10
#define MCU_CHAR_LCD_E_GPIO_Port GPIOD
#define MCU_CHAR_LCD_DATA0_Pin GPIO_PIN_0
#define MCU_CHAR_LCD_DATA0_GPIO_Port GPIOD
#define MCU_CHAR_LCD_DATA1_Pin GPIO_PIN_1
#define MCU_CHAR_LCD_DATA1_GPIO_Port GPIOD
#define MCU_CHAR_LCD_DATA2_Pin GPIO_PIN_2
#define MCU_CHAR_LCD_DATA2_GPIO_Port GPIOD
#define MCU_CHAR_LCD_DATA3_Pin GPIO_PIN_3
#define MCU_CHAR_LCD_DATA3_GPIO_Port GPIOD
#define MCU_CHAR_LCD_DATA4_Pin GPIO_PIN_4
#define MCU_CHAR_LCD_DATA4_GPIO_Port GPIOD
#define MCU_CHAR_LCD_DATA5_Pin GPIO_PIN_5
#define MCU_CHAR_LCD_DATA5_GPIO_Port GPIOD
#define MCU_CHAR_LCD_DATA6_Pin GPIO_PIN_6
#define MCU_CHAR_LCD_DATA6_GPIO_Port GPIOD
#define MCU_CHAR_LCD_DATA7_Pin GPIO_PIN_7
#define MCU_CHAR_LCD_DATA7_GPIO_Port GPIOD
#define MCU_LED1_RED_Pin GPIO_PIN_4
#define MCU_LED1_RED_GPIO_Port GPIOB
#define MCU_LED2_BLUE_Pin GPIO_PIN_8
#define MCU_LED2_BLUE_GPIO_Port GPIOB
#define MCU_LED2_GREEN_Pin GPIO_PIN_9
#define MCU_LED2_GREEN_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
#define HIGH                (1U)
#define LOW                 (0U)

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
